# Reading Financial Data

In [7]:
file = 'data/all_stocks_5yr.csv'
with open(file, 'r') as f:
    for _ in range(5):
        print(f.readline(), end='')

date,open,high,low,close,volume,Name
2013-02-08,15.07,15.12,14.63,14.75,8407500,AAL
2013-02-11,14.89,15.01,14.26,14.46,8882000,AAL
2013-02-12,14.45,14.51,14.1,14.27,8126000,AAL
2013-02-13,14.3,14.94,14.25,14.66,10259500,AAL

## Reading CSV with Python

In [8]:
import csv
csv_reader = csv.reader(open(file, 'r'))
data_csv = list(csv_reader)
data_csv[1000:1005]

[['2017-01-27', '50.0', '50.0', '46.72', '46.95', '19411050', 'AAL'],
 ['2017-01-30', '45.62', '45.92', '43.86', '44.9', '16786050', 'AAL'],
 ['2017-01-31', '44.79', '44.84', '43.742', '44.25', '11719842', 'AAL'],
 ['2017-02-01', '44.75', '45.0', '43.91', '44.05', '7955513', 'AAL'],
 ['2017-02-02', '43.61', '44.52', '43.57', '44.01', '7607665', 'AAL']]

In [9]:
csv_reader = csv.DictReader(open(file, 'r'))
data_dict = list(csv_reader)
data_dict[:3]

[{'date': '2013-02-08',
  'open': '15.07',
  'high': '15.12',
  'low': '14.63',
  'close': '14.75',
  'volume': '8407500',
  'Name': 'AAL'},
 {'date': '2013-02-11',
  'open': '14.89',
  'high': '15.01',
  'low': '14.26',
  'close': '14.46',
  'volume': '8882000',
  'Name': 'AAL'},
 {'date': '2013-02-12',
  'open': '14.45',
  'high': '14.51',
  'low': '14.1',
  'close': '14.27',
  'volume': '8126000',
  'Name': 'AAL'}]

In [10]:
sum([float(l['close']) for l in data_dict]) / len(data_dict)

83.04376276476357

In [11]:
sum(l['Name']=='AAL' for l in data_dict)

1259

In [12]:
sum([float(l['close']) for l in data_dict if l['Name']=='AAL']) / sum(l['Name']=='AAL' for l in data_dict)

38.39325226370134

## Reading CSV with pandas

In [13]:
import pandas as pd
data_df = pd.read_csv(file, index_col=0,
                      parse_dates=True)

In [14]:
data_df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 619040 entries, 2013-02-08 to 2018-02-07
Data columns (total 6 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   open    619029 non-null  float64
 1   high    619032 non-null  float64
 2   low     619032 non-null  float64
 3   close   619040 non-null  float64
 4   volume  619040 non-null  int64
 5   Name    619040 non-null  object
dtypes: float64(4), int64(1), object(1)
memory usage: 33.1+ MB

In [15]:
data_df.tail()

             open   high    low  close   volume Name
date
2018-02-01  76.84  78.27  76.69  77.82  2982259  ZTS
2018-02-02  77.53  78.12  76.73  76.78  2595187  ZTS
2018-02-05  76.64  76.92  73.18  73.83  2962031  ZTS
2018-02-06  72.74  74.56  72.13  73.27  4924323  ZTS
2018-02-07  72.70  75.00  72.69  73.86  4534912  ZTS

In [16]:
data_df['close'].loc[data_df['Name'] == 'AAPL'].mean()

109.06669849086578

## Writing to and Reading from Excel and JSON

### .xls

In [17]:
df_aapl = data_df.loc[data_df['Name'] == 'AAPL']
df_aapl.to_excel('data/aapl.xls', 'AAPL')

C:\Users\Michael\AppData\Local\Temp\ipykernel_25420\3552209725.py:2: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  df_aapl.to_excel('data/aapl.xls', 'AAPL')

In [18]:
data_copy_1 = pd.read_excel('data/aapl.xls', 'AAPL', index_col=0)
data_copy_1.head()

               open     high      low    close     volume  Name
date
2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL

### .xlsx

In [19]:
import openpyxl
# another alternative is xlwings
file_xlsx = 'data/aapl.xlsx'
wb = openpyxl.Workbook()
wb.save(file_xlsx)

In [20]:
from openpyxl.utils.dataframe import dataframe_to_rows
wb = openpyxl.load_workbook(file_xlsx)
ws = wb.active

rows = dataframe_to_rows(df_aapl, index=True, header = True)
for r_idx, row in enumerate(rows, 1):
    for c_idx, value in enumerate(row, 1):
        ws.cell(row=r_idx, column=c_idx, value=value)
wb.save(file_xlsx)

In [21]:
wb_obj = openpyxl.load_workbook(file_xlsx)
sheet_obj = wb_obj.active
cell_obj = sheet_obj['C5']
print(cell_obj.value)

68.9114

https://www.blog.pythonlibrary.org/2021/07/20/reading-spreadsheets-with-openpyxl-and-python/

In [22]:
for value in sheet_obj.iter_rows(min_row=1, max_row=3, min_col=1, max_col=3, values_only=True):
    print(value)

(None, 'open', 'high')
('date', None, None)
(datetime.datetime(2013, 2, 8, 0, 0), 67.7142, 68.4014)

### .json

In [23]:
df_aapl.to_json('data/aapl.json')

In [24]:
ls -n data

 Volume in drive C is OS
 Volume Serial Number is 8A40-DA6B

 Directory of C:\Users\Michael\source\algo-trading-examples


 Directory of C:\Users\Michael\source\algo-trading-examples\data

2023/12/25  17:49    <DIR>          .
2023/12/25  17:49    <DIR>          ..
2023/12/25  18:19           176,760 aapl.json
2023/12/25  18:19           129,024 aapl.xls
2023/12/25  18:19            58,639 aapl.xlsx
2023/12/13  22:41        29,580,549 all_stocks_5yr.csv
2023/12/25  18:18            95,240 data.h5
2023/12/25  18:18                 0 data.h5ts
2023/12/25  18:18           152,878 data2.h5
               7 File(s)     30,193,090 bytes
               2 Dir(s)  62,514,995,200 bytes free

File Not Found

In [25]:
data_copy_2 = pd.read_json('data/aapl.json')

In [26]:
data_copy_2.head()

               open     high      low    close     volume  Name
2013-02-08  67.7142  68.4014  66.8928  67.8542  158168416  AAPL
2013-02-11  68.0714  69.2771  67.6071  68.5614  129029425  AAPL
2013-02-12  68.5014  68.9114  66.8205  66.8428  151829363  AAPL
2013-02-13  66.7442  67.6628  66.1742  66.7156  118721995  AAPL
2013-02-14  66.3599  67.3771  66.2885  66.6556   88809154  AAPL

## Open Data Sources

## quandl

In [27]:
import configparser

In [28]:
config = configparser.ConfigParser()
config.read('../aq.cfg')

['../aq.cfg']

In [29]:
import quandl as q
data = q.get('BCHAIN/MKPRU', api_key=config['quandl']['api_key'])

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 5471 entries, 2009-01-02 to 2023-12-25
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Value   5471 non-null   float64
dtypes: float64(1)
memory usage: 85.5 KB

In [31]:
data['Value'].resample('A').last()

Date
2009-12-31        0.000000
2010-12-31        0.299998
2011-12-31        4.470000
2012-12-31       13.570000
2013-12-31      746.900000
2014-12-31      315.700000
2015-12-31      428.230000
2016-12-31      958.120000
2017-12-31    14165.575000
2018-12-31     3791.545833
2019-12-31     7219.600000
2020-12-31    28856.590000
2021-12-31    47132.960000
2022-12-31    16599.690000
2023-12-31    43013.460000
Freq: A-DEC, Name: Value, dtype: float64

In [32]:
data.keys()

Index(['Value'], dtype='object')

In [33]:
data_fse = q.get('FSE/SAP_X', start_date='2019-6-1',
                 end_date='2023-5-1',
                 api_key=config['quandl']['api_key'])

In [34]:
data_fse.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 381 entries, 2019-06-03 to 2020-12-01
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Open                   381 non-null    float64
 1   High                   381 non-null    float64
 2   Low                    381 non-null    float64
 3   Close                  381 non-null    float64
 4   Change                 0 non-null      object
 5   Traded Volume          381 non-null    float64
 6   Turnover               381 non-null    float64
 7   Last Price of the Day  0 non-null      object
 8   Daily Traded Units     0 non-null      object
 9   Daily Turnover         0 non-null      object
dtypes: float64(6), object(4)
memory usage: 32.7+ KB

In [35]:
data_fse.head()

,Open,High,Low,Close,Change,Traded Volume,Turnover,Last Price of the Day,Daily Traded Units,Daily Turnover
Date,,,,,,,,,,
2019-06-03,109.60,111.38,109.18,111.22,None,2280685.0,252856160.0,None,None,None
2019-06-04,108.92,111.14,108.28,111.14,None,2637001.0,290661920.0,None,None,None
2019-06-05,112.24,113.92,111.48,111.96,None,2471815.0,277935968.0,None,None,None
2019-06-06,112.16,112.80,110.58,111.38,None,1885826.0,210470160.0,None,None,None
2019-06-07,112.10,114.24,112.08,113.72,None,2354457.0,267202080.0,None,None,None

In [36]:
q.ApiConfig.api_key = config['quandl']['api_key']
#vol = q.get('VOL/MSFT')
#vol.iloc[:,:10].info()
#vol[['IvMean30', 'IvMean60', 'IvMean90']].tail()

In [37]:
data_fse.keys()

Index(['Open', 'High', 'Low', 'Close', 'Change', 'Traded Volume', 'Turnover',
       'Last Price of the Day', 'Daily Traded Units', 'Daily Turnover'],
      dtype='object')